Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/older_jobseekers.html.txt.tmx
Source language: en
Languages: ga

source: Older people and jobseeker's payments
ga: Daoine scothaosta agus íocaíochtaí cuardaitheora poist

source: There are some special administrative provisions in place for older jobseekers. These provisions aim to help people during the transition from the labour force into retirement
ga: Tá roinnt forálacha speisialta riaracháin i bhfeidhm do chuardaitheoirí poist scothaosta, agus é mar aidhm leo an t-aistriú ón lucht saothair go scor a éascú

source: These provisions recognise that older jobseekers may have more difficulty re-training and re-entering the workplace if they lose their job when they are near to retirement age
ga: Aithníonn na forálacha sin go bhféadfadh go mbeadh sé ní ba dheacra do chuardaitheoirí poist scothaosta athoiliúint a fháil agus athdhul isteach sa lucht saothair dá gcaillfidís a bpost agus iad ag druidim ar aois scoir

source: Older people in some cases have to retire at 65 but they may not qualify for a State pension until they are 66
ga: I gcásanna áirithe, bíonn ar dhaoine scothaosta dul ar scor agus iad 65 bliain d’aois, ach is féidir nach gcáileoidh siad do phinsean Stáit go dtí go mbainfidh siad 66 bliain amach

source: You can also read about Early retirement
ga: Is féidir leat a léamh faoi Luathscor freisin

source: Jobseeker’s Benefit for people over 65
ga: Sochar Cuardaitheora Poist do dhaoine os cionn 65 bliain d’aois

source: People over 65 who are claiming Jobseeker’s Benefit (JB), and who have at least 156 PRSI contributions, can continue to receive JB until their 66th birthday even if their claim is due to end before that date
ga: Daoine atá os cionn 65 bliain d’aois, atá ag éileamh Sochar Cuardaitheora Poist agus a bhfuil 156 ranníocaíocht ÁSPC ar a laghad déanta acu, is féidir leo leanúint le Sochar Cuardaitheora Poist a fháil go dtí go mbainfidh siad 66 bliain amach, fiú amháin i gcásanna ina bhfuil a n-éileamh le dul in éag roimh an dáta sin

source: This special provision extends the duration of JB for people aged 65 and over and aims to support the transition of older workers from the labour force into retirement
ga: Tá an fhoráil speisialta sin ar fáil do thréimhse iomlán an tSochair Chuardaitheora Poist do dhaoine atá 65 bliain d’aois nó níos sine agus is é an aidhm atá léi tacú le hoibrithe scothaosta agus iad ag aistriú ón lucht saothair go scor

source: Other arrangements for older jobseekers
ga: Socruithe eile do chuardaitheoirí poist scothaosta

source: From 1 January 2014, if you are claiming Jobseeker’s Benefit or Allowance and are aged 62 or over, the following applies:
ga: Más rud é go bhfuil Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist á éileamh agat agus go bhfuil tú 62 bliain d’aois nó níos sine, beidh feidhm ag an méid seo a leanas ón 1 Eanáir 2014:

source: • You will no longer be required to engage with the compulsory activation process (see below) and you will not be subject to penalty rates for non-engagement
ga: • Ní éileofar ort a thuilleadh páirt a ghlacadh sa phróiseas gníomhachtaithe (féach thíos) agus ní bheidh tú faoi réir rátaí pionóis de bharr neamh-rannpháirtíochta

source: • You can voluntarily avail of a range of supports (for example, training or employment support programmes) from the Department of Social Protection
ga: • Beidh tú in ann leas a bhaint go deonach as raon tacaí éagsúla (mar shampla, cláir thacaíocht oiliúna nó fostaíochta) ón Roinn Coimirce Sóisialaí

source: • However, when you turn 62, if you are already engaged in activation (selected and referred for engagement) or if you are currently taking part in an activation programme (such as Community Employment, JobPath or training courses), you are expected to complete the programme
ga: • Áfach, nuair sroichfidh tú 62 bliana d’aois, má ghlacann tú páirt i ngníomhachtú (roghnaithe agus tarchurtha i gcomhair rannpháirtíochta) nó má ghlacann tú páirt i gclár gníomhachtaithe (mar shampla, Fostaíocht Pobail, JobPath nó cúrsa oiliúna, bítear ag súil leis go gcríochnaíonn tú an clár

source: If you leave activation programmes before completion your jobseeker payment may be reduced
ga: Má fhágann tú cláir gníomhachtaithe roimh chríochnú, d’fhéadfadh go laghdófar d’íocaíocht

source: │Labour market activation policies are designed to give jobseekers a better chance of finding employment
ga: │Is é is aidhm do bheartais chun an lucht saothair a ghníomhachtú ná deis níos fearr do chuardaitheoirí poist fostaíocht a fháil

source: The Department of Social Protection describes activation as its engagement with jobseekers to support them back into employment
ga: Cuireann an Roinn Coimirce Sóisialaí síos ar ghníomhachtú mar rannpháirtíocht le cuardaitheoirí poist atá dírithe ar thacaíocht a thabhairt dóibh filleadh ar ais ar an obair

source: Jobseekers are expected to fully engage with this process and use the supports offered during the activation process which might include education or training schemes, employment support schemes to help them back into the workplace, internships and other supports.│
ga: Tá súil ann go nglacfaidh cuardaitheoirí poist páirt iomlán sa phróiseas agus go mbainfidh siad úsáid as na tacaí a chuirfear ar fáil dóibh le linn an phróisis ghníomhachtaithe, lena n-áireofaí scéimeanna oideachais agus oiliúna, scéimeanna tacaíocht fostaíochta chun cabhrú leo filleadh ar an ionad oibre, intéirneachtaí agus tacaí eile.│

source: │People aged under 62 who do not engage with the activation process may have their payment reduced and can subsequently be disqualified from their payment for up to 9 weeks
ga: │Daoine faoi bhun 62 bliain d’aois nach nglacann páirt sa phróiseas gníomhachtaithe, is féidir go laghdófar an íocaíocht a fhaigheann siad agus go ndícháileofar iad ina ndiaidh sin ó íocaíocht a fháil ar feadh 9 seachtaine ar a mhéad

source: │Read more about the conditions that apply to your jobseekers’ payment
ga: │Léigh tuilleadh faoi na coinníollacha a bhaineann leis an íocaíocht cuardaitheora poist

source: In addition, most jobseekers aged 62 or over will be placed on a yearly signing arrangement with their Intreo Centre or local Social Welfare Branch Office (this means that they do not need to sign on regularly) and most will be transferred to Electronic Fund Transfer (EFT) payments so payment can be made directly into their bank account
ga: Ina theannta sin, déanfar formhór na gcuardaitheoirí poist atá 62 bliain d’aois nó níos sine a chur ar shocrú sínithe bhliantúil le hionad Intreo nó le hoifig áitiúil leasa shóisialaigh (a fhágfaidh nach mbeidh orthu síniú ar an dól go rialta) agus aistreofar an chuid is mó díobh go híocaíochtaí Ríomhaistriú Airgid (EFT) ionas go mbeifear in ann íocaíochtaí a dhéanamh go díreach ina gcuntas bainc

source: Certain categories of older jobseekers may be required to engage more frequently with their Intreo Centre or local Social Welfare Branch Office
ga: Is féidir go n-éileofar ar chatagóirí áirithe de chuardaitheoirí poist dul i dteagmháil níos minice leis an ionad áitiúil leasa shóisialaigh

source: For example, casual jobseekers of 62 and older must continue to submit weekly dockets of their work patterns
ga: Mar shampla, ní mór do chuardaitheoirí poist atá 62 bliain d’aois nó níos sine agus a dhéanann obair ócáideach taifid sheachtainiúla a chur isteach ar a n-uaireanta oibre

source: Note that to qualify for either Jobseeker’s Benefit or Allowance you must be genuinely seeking work and be available for full-time employment and these conditions continue to apply to all jobseekers
ga: Tabhair faoi deara: chun cáiliú do Shochar Cuardaitheora Poist nó do Liúntas Cuardaitheora Poist, ní mór iarracht mhacánta a bheith á déanamh agat obair a fháil agus ní mór duit bheith ar fáil d’fhostaíocht lánaimseartha
